Revit 2024 API
BuiltInFailures.ZoneFailures Properties
The BuiltInFailures.ZoneFailures type exposes the following members.
Properties
Name | Description
ZoneExistsNotEnclosedRoom
 Zone has a room not enclosed.
ZoneNotEnclosed
 Zone not enclosed totally.
ZonesOverlapWarning
 Zone overlap to another zone or another room.
See Also
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace